Revit 2026 API

# SolidOptions Properties

---

The SolidOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExtraFaceAndEdgeHistoryKey | Optional extra key used to create face and edge histories for the Solid. If extraFaceAndEdgeHistoryKey is higher than -1, the Solid's face and edge histories will be created depending on the geometry generation of the Solid. |
|  | GraphicsStyleId | Defines the graphics style id for the Solid. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | MaterialId | Defines the material id for the Solid. |

#### Reference

SolidOptions Class

Autodesk.Revit.DB Namespace